const fs = require('fs');

const text = `Не бери сумного, не бери до голови
Не зважай, все переживи
Не кажи нікому, як воно тебе пече
Журба най в море потече
І нехай десь там буде дощ
І нехай десь там впаде сніг
Але твоя сила жива,
Бо давно в тебе є оберіг
Не бери чужого, не бери до голови
Не дрімай, зірку уяви
Не кажи нікому, як вона тобі горить
Мрія най в небо полетить
І нехай десь там буде дощ.
І нехай десь там буде сніг.
Але твоя сила жива,
Бо давно в тебе є оберіг`;

// Write to file
const pathToFile = 'd02/n_1.txt';
fs.writeFileSync(pathToFile, text, { encoding: 'utf8', flag: 'a' });



// write file from array
const text2 = [
    'Не бери сумного, не бери до голови',
    'Не зважай, все переживи',
    'Не кажи нікому, як воно тебе пече',
    'Журба най в море потече',
    'І нехай десь там буде дощ',
    'І нехай десь там впаде сніг',
    'Але твоя сила жива,',
    'Бо давно в тебе є оберіг'
];
 
fs.writeFileSync('./d02/n_2.txt' , text2.join('\r\n'), { encoding: 'utf8',  flag : 'w'});


